<script setup lang="ts">
type Tabs =
  | 'tokarniye'
  | 'frezerniye'
  | 'electroerozion'
  | 'termicheskaya'
  | 'koordinatno-raschtochniye'
  | 'shlifovalniye'
  | 'dolbeznaya'

const TABS: { id: Tabs; name: string }[] = [
  {
    id: 'tokarniye',
    name: 'Токарные работы',
  },
  {
    id: 'frezerniye',
    name: 'Фрезерные работы',
  },
  {
    id: 'electroerozion',
    name: 'Электроэрозионная обработка (ЭЭО)',
  },

  {
    id: 'termicheskaya',
    name: 'Термическая обработка',
  },

  {
    id: 'koordinatno-raschtochniye',
    name: 'Координатно-расточные работы',
  },

  {
    id: 'shlifovalniye',
    name: 'Шлифовальные работы',
  },

  {
    id: 'dolbeznaya',
    name: 'Долбёжная обраотка',
  },
]

const tab = ref<Tabs>('tokarniye')
</script>

<template>
  <div class="mt-10 flex items-stretch gap-4 max-lg:flex-col max-lg:items-start">
    <div
      class="border-r-foreground/20 m-scrollbar flex w-[200px] shrink-0 flex-col gap-1 border-r-1 pr-4 max-lg:w-full max-lg:flex-row max-lg:items-center max-lg:overflow-y-auto max-lg:border-r-0 max-lg:pr-0"
    >
      <span
        v-for="item in TABS"
        :key="item.id"
        class="hover hover:bg-secondary/20 bg-surface block shrink-0 cursor-pointer rounded-lg px-4 py-2 transition-all duration-150"
        :class="{ 'bg-secondary! text-background hover:bg-secondary!': tab === item.id }"
        @click="tab = item.id"
        >{{ item.name }}</span
      >
    </div>

    <div>
      <!-- Токарные -->
      <section v-show="tab === 'tokarniye'">
        <h2 class="border-secondary border-l-2 pl-4 text-xl font-semibold">
          Токарные работы: основа современного производства
        </h2>

        <p class="mt-4">
          Токарные работы – это высокоточная обработка заготовок, превращающая их в готовые детали,
          необходимые для работы механизмов и устройств. По сути, это процесс создания широчайшего
          спектра компонентов, без которых невозможно представить современную промышленность.
        </p>

        <p class="mt-4">
          Удивительно, но детали, изготовленные с помощью токарных операций, составляют около 70%
          всех механизмов и изделий в мире! Это делает токарную обработку самой востребованной
          разновидностью механической обработки.
        </p>

        <p class="mt-4">
          На токарных станках выполняются сложные и точные работы, позволяющие создавать детали с
          высокой степенью соответствия чертежам. Вот лишь некоторые примеры:
        </p>

        <ul class="mt-4 list-disc pl-6">
          <li>
            Изготовление валов, осей, шпилек, пальцев: ключевые элементы для передачи вращательного
            движения.
          </li>
          <li>
            Втулки, фильеры, шкивы, форсунки: детали, обеспечивающие функциональность различных
            систем и механизмов.
          </li>
          <li>
            Диски, стаканы, муфты, обоймы: компоненты, используемые в сборке узлов и агрегатов.
          </li>
          <li>
            Элементы для корпусов: детали, определяющие форму и защищающие внутренние компоненты.
          </li>
        </ul>

        <p class="mt-4">
          Благодаря современному оборудованию и опыту квалифицированных токарей, можно изготовить
          детали практически любой формы и сложности, отвечающие самым строгим требованиям.
        </p>

        <h3 class="mt-10 text-xl font-semibold">Токарные работы с ЧПУ</h3>

        <p class="mt-4">
          <strong>Соблюдение современных стандартов — наша задача:</strong> Вы можете заказать
          услугу токарной обработки с ЧПУ, воспользовавшись всеми преимуществами автоматизированного
          изготовления.
        </p>

        <p class="mt-4">
          Устали от неточностей и долгих сроков при токарной обработке? Переходите на современный
          уровень с токарными работами с ЧПУ!
        </p>

        <p class="mt-4">
          В отличие от традиционной ручной обработки, где точность и скорость зависят от оператора,
          ЧПУ (числовое программное управление) обеспечивает полную автоматизацию процесса.
        </p>

        <p class="mt-4">
          <strong>Какие преимущества вы получаете, выбирая токарную обработку с ЧПУ?</strong>
        </p>

        <ul class="mt-4 list-disc pl-6">
          <li>
            Высочайшая точность: Соблюдение всех размеров и допусков с прецизионной точностью.
          </li>
          <li>
            Стабильное качество: Полное исключение человеческого фактора гарантирует идентичность
            деталей в каждой партии.
          </li>
          <li>
            Сложная геометрия — не проблема: Возможность изготовления деталей с нестандартными и
            сложными формами.
          </li>
          <li>
            Оперативное выполнение заказов: Значительно сокращенные сроки изготовления даже самых
            сложных деталей.
          </li>
          <li>Экономия средств: Снижение себестоимости при среднесерийном производстве.</li>
        </ul>

        <p class="mt-4">
          Мы гарантируем соблюдение современных стандартов качества и предлагаем вам воспользоваться
          всеми преимуществами автоматизированного производства!
        </p>
      </section>
      <!-- Фрезерные -->
      <section v-show="tab === 'frezerniye'">
        <h2 class="border-secondary border-l-2 pl-4 text-xl font-semibold">
          Фрезерные работы: Точность и качество в каждой детали!
        </h2>

        <p class="mt-4">
          Ищете профессиональные фрезерные работы? Мы предлагаем высокоточную обработку металла,
          отвечающую самым строгим требованиям!
        </p>

        <p class="mt-4">
          <strong>Фрезерные работы</strong> – это не просто обработка металла, это искусство
          создания деталей с идеальной геометрией и соответствием чертежам. Для этого мы используем
          современные высокоточные станки, управляемые опытными специалистами, гарантирующими
          выполнение заказов в оговоренные сроки.
        </p>

        <p class="mt-4">
          В основе качественной фрезерной обработки лежит вращающаяся фреза с прочными и
          износостойкими зубьями, позволяющая срезать слой материала с максимальной точностью.
        </p>

        <h3 class="mt-10 text-xl font-semibold">Что такое фрезерная обработка?</h3>

        <p class="mt-4">
          Это процесс, в котором происходит срезание материала до достижения точного соответствия
          чертежу заказчика. Мы доводим металлические детали до максимально точных размеров,
          независимо от их формы и сложности.
        </p>

        <p class="mt-4">
          <strong
            >Мы выполняем фрезерные работы высокой точности для изделий следующих форм:</strong
          >
        </p>
        <ul class="mt-4 list-disc pl-6">
          <li>Торцевая</li>
          <li>Фасонная</li>
          <li>Коническая</li>
          <li>Цилиндрическая</li>
        </ul>

        <p class="mt-4">
          <strong>Фрезерная обработка металла – это универсальный инструмент для:</strong>
        </p>
        <ul class="mt-4 list-disc pl-6">
          <li>Обработки пазов</li>
          <li>Изготовления канавок и отверстий</li>
          <li>Фрезерования поверхностей и углублений</li>
        </ul>

        <h3 class="mt-10 text-xl font-semibold">Почему выбирают нас?</h3>
        <ul class="mt-4 list-disc pl-6">
          <li>
            <strong>Высокая точность:</strong> Современное оборудование и опытные специалисты
            гарантируют соответствие деталей чертежам.
          </li>
          <li>
            <strong>Качество:</strong> Используем только качественные материалы и инструменты.
          </li>
          <li><strong>Сроки:</strong> Выполняем заказы в строго оговоренные сроки.</li>
          <li>
            <strong>Индивидуальный подход:</strong> Учитываем все требования и пожелания заказчика.
          </li>
        </ul>

        <h3 class="mt-10 text-xl font-semibold">
          Фрезерные работы с ЧПУ: Точность, Скорость, Экономия!
        </h3>

        <p class="mt-4">
          <strong>Фрезерная обработка с ЧПУ</strong> – это современное решение для изготовления
          деталей сложной конфигурации с высокой точностью и эффективностью. Благодаря автоматизации
          процесса, вы получаете ряд неоспоримых преимуществ:
        </p>

        <ul class="mt-4 list-disc pl-6">
          <li>
            <strong>Высочайшая точность:</strong> Соблюдение всех размеров и допусков гарантировано!
          </li>
          <li>
            <strong>Минимизация человеческого фактора:</strong> Забудьте о погрешностях! Детали из
            одной партии будут идентичны.
          </li>
          <li>
            <strong>Нестандартная геометрия – не проблема:</strong> Мы воплотим в жизнь самые
            сложные проекты.
          </li>
          <li><strong>Быстрое изготовление:</strong> Сроки производства сокращаются в разы!</li>
          <li>
            <strong>Экономия средств:</strong> Снижение себестоимости при среднесерийных заказах.
          </li>
        </ul>

        <p class="mt-4">
          Мы работаем по современным стандартам и предлагаем вам воспользоваться всеми
          преимуществами фрезерной обработки с ЧПУ!
        </p>
      </section>

      <!-- Электроэрозионная обработка -->
      <section v-show="tab === 'electroerozion'">
        <h2 class="border-secondary border-l-2 pl-4 text-xl font-semibold">
          Электроэрозионная обработка: Когда искры творят чудеса! ✨
        </h2>

        <p class="mt-4">
          Сталкивались с ситуацией, когда нужно обработать сверхтвердый материал, создать сложную
          форму или изготовить деталь с ювелирной точностью? Тогда вам точно стоит узнать об
          электроэрозионной обработке (ЭЭО)!
        </p>

        <p class="mt-4">
          ЭЭО – это процесс, в котором металл удаляется с помощью импульсных электрических разрядов.
          Звучит как магия, правда? Но это чистая физика, позволяющая решать задачи, непосильные для
          традиционных методов механической обработки.
        </p>

        <h3 class="mt-10 text-xl font-semibold">Когда ЭЭО становится незаменимой:</h3>
        <ul class="mt-4 list-disc pl-6">
          <li>
            <strong>Обработка закале нных материалов:</strong> Когда твердость металла зашкаливает
            после термообработки, ЭЭО приходит на помощь.
          </li>
          <li>
            <strong>Сложные формы – не проблема!</strong> Создание отверстий замысловатой геометрии,
            контуров и профилей – это стихия ЭЭО.
          </li>
          <li>
            <strong>Точность до микрона:</strong> Изготовление матриц и пуансонов с минимальными
            зазорами и строжайшими допусками – задача для ЭЭО.
          </li>
          <li>
            <strong>Глубокие и тонкие отверстия:</strong> Прожиг отверстий малого диаметра на
            большую глубину – легко!
          </li>
        </ul>

        <h3 class="mt-10 text-xl font-semibold">Почему ЭЭО лучше других методов?</h3>
        <ul class="mt-4 list-disc pl-6">
          <li>
            <strong>Высочайшая точность:</strong> Получение деталей с заданными размерами и
            минимальными отклонениями.
          </li>
          <li>
            <strong>Всеядность:</strong> Обработка любых материалов, независимо от их твердости и
            прочности.
          </li>
          <li>
            <strong>Бережное отношение:</strong> Обработка нежестких деталей без риска деформации.
          </li>
        </ul>
      </section>

      <!-- Термическая обработка -->
      <section v-show="tab === 'termicheskaya'">
        <h2 class="border-secondary border-l-2 pl-4 text-xl font-semibold">
          Термическая обработка
        </h2>

        <p class="mt-4">
          Термическая обработка – это комплекс операций, включающий нагрев металла до определенной
          температуры, выдержку при этой температуре и последующее охлаждение с заданной скоростью.
          Цель – изменить физические и механические свойства металла, такие как твердость,
          прочность, пластичность и упругость.
        </p>

        <h3 class="mt-10 text-xl font-semibold">✅ Зачем это нужно?</h3>
        <ul class="mt-4 list-disc pl-6">
          <li>Улучшить обрабатываемость резанием</li>
          <li>Снять внутренние напряжения</li>
          <li>Подготовить к последующей закалке</li>
          <li>Повысить твердость и износостойкость</li>
          <li>Улучшить механические свойства</li>
        </ul>

        <h3 class="mt-10 text-xl font-semibold">✅ Основные виды термообработки стали:</h3>
        <ul class="mt-4 list-disc pl-6">
          <li>
            <strong>Отжиг:</strong> Медленный нагрев, выдержка и медленное охлаждение вместе с
            печью. Снимает внутренние напряжения, улучшает обрабатываемость.
          </li>
          <li>
            <strong>Нормализация:</strong> Нагрев, выдержка и охлаждение на воздухе. Улучшает
            механические свойства.
          </li>
          <li>
            <strong>Закалка:</strong> Нагрев, выдержка и резкое охлаждение (вода, масло, раствор).
            Значительно повышает твердость.
          </li>
          <li>
            <strong>Отпуск:</strong> Нагрев закаленного металла до определенной температуры,
            выдержка и охлаждение. Снимает напряжения после закалки и снижает твердость до нужного
            уровня.
          </li>
        </ul>
      </section>

      <!-- Координатно-расточные -->
      <section v-show="tab === 'koordinatno-raschtochniye'">
        <h2 class="border-secondary border-l-2 pl-4 text-xl font-semibold">
          Координатно-расточные работы
        </h2>

        <p class="mt-4">
          Координатно-расточная обработка — это сложный и высокоточный вид обработки деталей,
          требующий не только специализированного оборудования, но и высокого уровня квалификации
          оператора. Выполняется она на координатно-расточных станках, которые позволяют достигать
          исключительной точности в расположении отверстий и других элементов.
        </p>

        <h3 class="mt-10 text-xl font-semibold">Что умеет координатно-расточной станок?</h3>
        <p>
          Этот вид оборудования выполняет широкий спектр задач, требующих максимальной
          прецизионности:
        </p>
        <ul class="mt-4 list-disc pl-6">
          <li>
            <strong>Точное сверление:</strong> Создание отверстий с заданными параметрами и строгим
            соблюдением координат.
          </li>
          <li>
            <strong>Растачивание отверстий деталей:</strong> Увеличение диаметра существующих
            отверстий с высокой точностью и чистотой поверхности.
          </li>
          <li>
            <strong>Измерение и разметка:</strong> Контроль размеров и положения элементов детали, а
            также нанесение точной разметки для последующей обработки.
          </li>
        </ul>

        <p class="mt-4">
          Координатно-расточные станки незаменимы в промышленном производстве, где требуется высокая
          точность и повторяемость деталей. Они обеспечивают:
        </p>
        <ul class="mt-4 list-disc pl-6">
          <li>
            <strong>Высокую точность расположения отверстий:</strong> Это критически важно для
            сборки сложных механизмов и обеспечения их надёжной работы.
          </li>
          <li>
            <strong>Идеальную геометрию отверстий:</strong> Обеспечивает плотное прилегание
            сопрягаемых деталей и минимизирует износ.
          </li>
          <li>
            <strong>Возможность обработки сложных деталей:</strong> Координатно-расточные станки
            позволяют работать с деталями сложной формы и конфигурации.
          </li>
        </ul>
      </section>
      <!-- Шлифовальные -->
      <section v-show="tab === 'shlifovalniye'">
        <h2 class="border-secondary border-l-2 pl-4 text-xl font-semibold">Шлифовальные работы</h2>

        <h3 class="mt-10 text-xl font-semibold">Финальный штрих к совершенству детали</h3>

        <p class="mt-4">
          Шлифовальная обработка – это не просто механическое воздействие, это искусство доведения
          детали до идеала! ✅
        </p>

        <p class="mt-4">
          Суть шлифовки заключается в механическом воздействии абразивным инструментом на
          обрабатываемую поверхность. Цель? Достижение максимальной точности размеров и заданной
          шероховатости. Представьте себе, как из заготовки рождается идеально гладкая и точная
          деталь!
        </p>

        <p class="mt-4">
          Зачастую, шлифование является завершающим этапом в производственном процессе. Именно оно
          придаёт детали законченный вид и обеспечивает необходимые эксплуатационные характеристики.
        </p>

        <p class="mt-4">
          Главный инструмент шлифовщика – абразивный круг. Этот, казалось бы, простой инструмент
          способен творить чудеса! Благодаря своей структуре, он эффективно обрабатывает практически
          любые материалы, от металла до керамики.
        </p>

        <h3 class="mt-10 text-xl font-semibold">Преимущества шлифовки:</h3>

        <ul class="mt-4 list-disc pl-6">
          <li>
            <strong>Высокая точность размеров:</strong> Достижение минимальных отклонений от
            заданных параметров.
          </li>
          <li>
            <strong>Идеальная шероховатость поверхности:</strong> Обеспечение гладкости и отсутствие
            дефектов.
          </li>
          <li>
            <strong>Универсальность:</strong> Возможность обработки широкого спектра материалов.
          </li>
          <li>
            <strong>Улучшение эксплуатационных характеристик:</strong> Повышение износостойкости и
            долговечности детали.
          </li>
        </ul>

        <p class="mt-4">
          Шлифовка – это не просто обработка, это гарантия качества и надёжности вашей детали.
        </p>
      </section>

      <section v-show="tab === 'dolbeznaya'">
        <h2 class="border-secondary border-l-2 pl-4 text-xl font-semibold">Долбёжная обработка</h2>

        <p class="mt-4">
          Для получения деталей с требуемыми зубьями, шлицами, шпоночными пазами и точными размерами
          применяется долбежная обработка. Суть метода заключается в воздействии режущего
          инструмента (долбяка) на заготовку посредством возвратно-поступательных движений. Долбяк,
          представляющий собой резец с заостренными краями, совершает ударные движения, снимая
          стружку с обрабатываемой поверхности и постепенно формируя необходимый профиль.
        </p>
      </section>
    </div>
  </div>
</template>
